recipes/crispy-oven-balck-bean-tacos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Crispy Oven Baked Black Bean Tacos</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Crispy Oven Baked Black Bean Tacos</h1>

<div id="outline-container-org9f6acfa" class="outline-2">
<h2 id="org9f6acfa">Ingredients</h2>
<div class="outline-text-2" id="text-org9f6acfa">
<ul class="org-ul">
<li>Avocado oil for cooking</li>
<li>1/2 medium onion, finely chopped</li>
<li>4 cloves garlic, minced or grated</li>
<li>1 tsp smoked paprika</li>
<li>1/2 tsp ground coriander</li>
<li>1/2 tsp dry oregano</li>
<li>1/4 tsp dry thyme</li>
<li>2, 15oz cans black beans, rinsed and drained</li>
<li>2 chipotle peppers from a can packed in adobo sauce, minced</li>
<li>1/2 cup vegetable broth</li>
<li>8-10 corn tortillas</li>
<li>Salt and pepper to taste Lime wedges for serving</li>
<li>Avocado slices or Cilantro Lime Sauce (on the blog) for serving</li>
</ul>
</div>
</div>

<div id="outline-container-org343ccb6" class="outline-2">
<h2 id="org343ccb6">Method</h2>
<div class="outline-text-2" id="text-org343ccb6">
<ol class="org-ol">
<li>Preheat oven to 425F. To a large rimmed baking sheet, drizzle about 2 tablespoons of oil and brush to evenly coat.</li>
<li>Heat up a medium sized sauté pan over medium heat and add 1 tablespoon of oil to the pan to warm through.</li>
<li>Add the onions along with a pinch of salt and sauté until softened.</li>
<li>Stir in the garlic, sauteing until fragrant.</li>
<li>Sprinkle in the seasonings and stir to combine.</li>
<li>Add in the black beans and chipotle peppers and continue to sauté for 2-3 minutes.</li>
<li>Pour in the veggie broth and lightly mash your beans using the back of a cooking spoon until the mixture starts to bind together then remove from heat. Adjust salt and pepper to taste.</li>
<li>Wrap the stack of tortillas in a damp paper towel and microwave for 15-30 seconds to steam them. Take each taco and place on the greased baking sheet, giving a flip to coat both sides in oil. To each tortilla, spread about 2-3 tablespoons of the mashed black beans over half a tortilla and fold it over and flip the taco.</li>
<li>Arrange the folded tortillas on the greased baking sheet in a single layer with space between the tacos. Place in the oven to bake for 8 minutes, then carefully flip the tacos and bake for an additional 8-10 minutes until nice and golden.</li>
<li>Remove from the oven and allow to cool for 3-5 minutes to allow them to crisp up more and enjoy served with extra lime and salsas of choice.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
